//-----------------------------------------------------------------------------
// @brief  ターン継続処理クラス.
//-----------------------------------------------------------------------------
#include "BattleContinue.h"
#include "PlayScene.h"

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
BattleContinue::BattleContinue(class PlayScene* _playScene)
{
    m_pPlaySceneStorage = _playScene;
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
BattleContinue::~BattleContinue()
{
}

//-----------------------------------------------------------------------------
// @brief  初期化処理.
//-----------------------------------------------------------------------------
void BattleContinue::Init()
{
}

//-----------------------------------------------------------------------------
// @brief  更新処理.
//-----------------------------------------------------------------------------
TAG_BattleState BattleContinue::Update()
{
    auto CharacterALL = m_pPlaySceneStorage->GetCharacterArrayAddress();
    // 全員のアクションが終わるまで行動実行処理へ戻る
    for (int i = 0; i < CharacterALL.size(); i++)
    {
        if (!CharacterALL[i]->GetActionFlag())
        {
            return TAG_BattleState::MoveMentStart;
        }
    }

    // 全ての行動処理が完了しており敵も生きているためコマンド処理へ戻る前に行動フラグをfalseに戻す
    for (int i = 0; i < CharacterALL.size(); i++)
    {
        CharacterALL[i]->ActionInit();
    }
    return TAG_BattleState::CommandProcess;
}

//-----------------------------------------------------------------------------
// @brief  描画処理.
//-----------------------------------------------------------------------------
void BattleContinue::Draw()
{
    printfDx("バトル継続判定処理");
}
